package 객체;

public class class_객체 {//<<<얘가 클래스

	public static void main(String[] args) {
		// 클래스
		/*main클래스:main메소드가 들어있어서 실행용이다(어떤걸 실행해서 결과를 볼 떄)
		 * 라이브러리 클래스 두개로 나눌 수 있다:다른 클래스에서 보조로 사용할 목적으로 만들어서 혼자 실행 할 수 없다
		 * 어떤 언어던지 main이 있는곳을 먼저 찾아서 컴파일을 먼저 한다
		 * 라이브러리를 사용하려면 객체를 생성해야 사용할 수 있음//
		 * 
		 * 
		 * 클래스의 구성 요소
		 * 필드(변수, 상수):저장 공간
		 * 메소드 : 입력값을 받아서(없을 수도 있음)프로그램을 실행하여 결과값을 반환
		 * 
		 * 클래스란 객체를 정의해 놓은 것이다//
		 * 
		 * 
		 * 
		 */
		
		
		//메소드
		/*
		 * 작업을 수행하기 위한 명령문의 집합
		 * 어떤 값을 입력받아서 처리하고 그 결과르 ㄹ돌려준다
		 * 반복적인 코드를 줄이고 코드의 관리가 용이하다
		 * 반복적으로 수행되는 여러 문장을 메서드로 작성한다
		 * 
		 * 리턴 값이 존재할 경우 return작성, 없을 경우 void작성
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 */
		
		
		class Chicken{
			
			int egg;
			int pan;
			
			public Chicken() {
			}
		static void main(String[]arg) {
			
		}
		}
		Chicken a = new Chicken();
		
	}

}
