package 객체;

public class 상속 {

	//상속
	/*
	 * 상속을 받으면 new를 쓰지 않고도 객체 생성이 가능하다
	 * 기존의 클래스를 재사용 해서 새로운 클래스를 작성하는것
	 * 두 클래스르르 조상과 자손으로 관계를 맺어주는것
	 * 생성자와 초기화 블럭을 제외한 멤버변수와 멤버 메소드를 상속 받는다
	 * 자손 클래스 extends 조상 클래스{}로 사용한다
	 * child extends parent
	 * grandchild extends child의 구조라면
	 * grandchild는 child와 parent에서 다 상속받은 것을 사용할 수 있다
	 * 
	 * 객체 생성 할때는 가끔 사용할떄 어떨때는 사용하지 않고 어떨떄는 사용 할때 쓴다
	 * 그리고 계속 사용하는것들을 상속 받는다
	 * 상속을 받을거면 공통된것을 찾는다 상속은 자주 쓰는것들을 다시 만드지 않고 상속하여 계속 쓰고
	 * 객체 생성은 필요할때만 가끔 만들어 쓴다
	 * 
	 * 
	 * 
	 * 
	 * 
	 */
	
	
	
	
	
	
	
	
}
