package _07object클래스;

public class _String클래스 {

	
	/*//표를 보고 쓸만한거를 외워야할듯
	 * -------------------------------------------
	 * char[]c={h,e,l,l,o,}
	 * String s = new String(c);=====  s="hello"
	 * -------------------------------------------
	 * String concat(String str)문자열 두 개를 붙여주는것
	 * Strings2=s.concat("World)=======s2="hello world"
	 * ---------------------------------------=----
	 * contain("검색할 글자열") 해당 글자가 문자열 안에 있는지 검사
	 * 
	 * ---------------------------------------=----
	 * endwith(suffix)
	 * 문자열의 끝 부분 검사하는 메소드로 주로 확장자 검색할때 쓰는듯
	 * ---------------------------------------=----
	 * boolean wqualsIgnoreCase(String str)
	 * 대소문자 구분 없이 비교
	 * ---------------------------------------=----
	 * indexOf(int ch)
	 * 주어진 문자 ch가 문자열에 존재하는지 확인하여 위치(index)를 알려준다 못찾으면 -1반환
	 * ---------------------------------------=----
	 * indexOf(String str)
	 * 주어진 문자 str가 문자열에 존재하는지 확인하여 위치(index)를 알려준다 못찾으면 -1반환
	 * ---------------------------------------=----
	 * intern
	 * 자주 사용하지 않음
	 * ---------------------------------------=----
	 * int lastIndex(int ch)
	 * abckdsa에서 indexOf(a)를 하면 0이지만 
	 * lastIndexOf는 끝에서부터 검색해서 6이 반환된다
	 * ---------------------------------------=----
	 * int lastIndex(String str)
	 * 도 비슷
	 * ---------------------------------------=----
	 * replace(a,b)
	 * 해당 문자열에서 a를 b로 교체
	 * char과 String두 가지 형태 있음
	 * --------------------------------------------
	 * replaceFirst
	 * 는 처음 나오는 문자열만 바꿈
	 * --------------------------------------------
	 * String[] split(String regex)
	 * 문자열을 어떤걸 기준으로 나눌것인가
	 * ex)
	 * ,를 입려하면 ,기준으로 분리
	 * --------------------------------------------
	 * String[] split(String regex,int limit)
	 * limit 수 만큼만 나눈다
	 * ,가 얼마나 있던 2를 입력하면 두개로만 나눔
	 * --------------------------------------------
	 * subStirng(int begin)
	 * begin번째부터 있는 문자열을 가져온다
	 * subStirng(int begin,int end)
	 * begin번째부터 end번째까지의 문자를 반환하는데 end번째 문자는 반환하지 않는다
	 * --------------------------------------------
	 * tolowercase, toUppercase
	 * 대문자 소문자
	 * * --------------------------------------------
	 * trim()
	 * 문자열의 왼쪽 끝과 오른쪽 끝네 인ㅆ는 공백을 없애는데 중간에는 없애지 않는다
	 * 
	 * 
	 * 
	 * 
	 * 
	 */
}
