package _07object클래스;

public class Math_wrapper {

	public static void main(String[] args) {

		
		
		/*Math
		 * abs는 절대값
		 * --------------------------------------------
		 * double ceil(double a)
		 * 주어진 값을 올림
		 * --------------------------------------------
		 * double floor(double a)
		 * 주어진 값을 내림
		 * --------------------------------------------
		 * max(a,b)
		 * 큰 값을 비교하여 반환
		 * 
		 * --------------------------------------------
		 * min(a,b)
		 * 작은값 반환
		 * --------------------------------------------
		 * rint(double)
		 * 가까운 정수값 souble형 반환
		 * --------------------------------------------
		 * round
		 * 소수 첫째자리에서 반올림한 값
		 * --------------------------------------------
		 * --------------------------------------------
		 */ 
		 
		
		/* Wrapper class
		 * Boolean, Character, Byte, Short,Integer, Long, Float, Double
		 * 
		 * wrapper class들은 전부 다 final이 붙어서 상속받을 수 없다.
		 * 
		 * --------------------------------------------
		 * 
		 * 
		 * 
		 */
	}

}
