
public class 인터페이스 {

	
	
	/*
	 * 인터페이스 안에 있는것은 전부다 추상 메소드이다
	 * 
	 * 인터페이스는 개발 코드와 객체가 서로 통신하는 접점이다
	 * 
	 * 일종의 추상 클래수, 추상 클래스보다 추상화 정도가 높다
	 * 실제 수현된 것이 전혀 없는 기본 설계도
	 * 
	 * 여기에 일반 변수는 넣을 수 없어서 상수만 넣어야 한다
	 * 또한 객체도 생성할 수 없다
	 * 
	 * 사용 용도는 미리 전해진 규칙에 맞게 사용되도록 하는 용도이다
	 * 
	 * class 대신 interface로 쓴다
	 * 상수는 대문자로 쓰고 앞에 파이널을 쓴다
	 * 
	 * 인터페이스는 상수 필드만 선언 가능
	 * --데이터 저장하지 않음--상수는 이미 한 값이 정해져 있어서 다른 값 저장 불가
	 * 인터페이스에 선언된 필드는 모두 퍼블릭 스테틱 파이널을 해야한다
	 * 
	 * 상수에 서로 다른 단어로 구석외어 있을 경우 언더바로 연결
	 * 
	 * 선언과 동시레 초기값 지정
	 * 스테틱 블록 작성 불가
	 * 
	 */
}
